In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  
password = getpass.getpass()

········

In [3]:
connection = 'mysql+pymysql://root:' + password + '@localhost/sakila' 
engine = create_engine(connection)

In [ ]:
# 7.1 Check the number of rentals for each customer for May

In [4]:
df_may=pd.read_sql_query('SELECT customer_id,COUNT(rental_id) as count_may FROM rentals_may GROUP BY customer_id', engine)
df_may.head()

   customer_id  count_may
0          130          4
1          459          2
2          408          6
3          333          2
4          222         10

In [ ]:
# 7.2 Check the number of rentals for each customer for June

In [5]:
df_june=pd.read_sql_query('SELECT customer_id,COUNT(rental_id) as count_june FROM rentals_june GROUP BY customer_id', engine)
df_june.head()

   customer_id  count_june
0          416          15
1          516          18
2          239          15
3          285           9
4          310          18

In [ ]:
# 8. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [6]:
def compare (june,may):
    df_merged=june.merge(may,how='left',on='customer_id').fillna(0)
    df_merged['difference']=df_merged['count_june']-df_merged['count_may']
    df_merged=df_merged[df_merged['difference']>0]
    return df_merged

In [7]:
display(compare(df_june, df_may))

     customer_id  count_june  count_may  difference
0            416          15        6.0         9.0
1            516          18        4.0        14.0
2            239          15       12.0         3.0
3            285           9        0.0         9.0
4            310          18        2.0        16.0
..           ...         ...        ...         ...
582          501           6        4.0         2.0
583          555           3        0.0         3.0
584          425           3        2.0         1.0
586          335           3        0.0         3.0
587          226           6        0.0         6.0

[513 rows x 4 columns]